*** NEXT [#A] router MUST receive an ACK when adding a schedule to a scheduler.
:PROPERTIES:
:ID:       DF4440E7-58AC-4AE9-8991-F24934C0C370
:CREATED:   <2015-12-30 Wed 17:00>
:END:
:LOGBOOK:
CLOCK: [2016-01-05 Tue 15:06]
CLOCK: [2015-12-30 Wed 16:59]--[2015-12-30 Wed 17:10] =>  0:11
:END:
The router needs to check for an ACK when forwarding a SCHEDULE to a
scheduler if the guarantee header has been set. If no ACK is received after
<threshold> then the message should be sent to a different scheduler. (Also
send a remove schedule command in order to disable just in case it was added).
*** BUG on_receive_request scheduler infinite loop
:PROPERTIES:
:ID:       8C5D596A-30B2-4EA1-A715-D3E613A19260
:END:
:LOGBOOK:
CLOCK: [2015-12-30 Wed 15:05]--[2015-12-30 Wed 15:06] =>  0:01
:END:
[2015-12-30 Wed 15:05]
[[file:~/Code/enderlabs/eventboard.io/mq/eventmq/router.py::self.on_receive_request(msg)]]
sending a SUBSCRIBE with no connected schedulers causes an infinite loop
*** TODO [#C] There should be a way to verify the scheduled jobs are still valid in EventMQ
:PROPERTIES:
:ID:       C783B048-777D-424B-B788-D0DEE1C86E6E
:END:
:LOGBOOK:
CLOCK: [2015-12-22 Tue 15:17]--[2015-12-28 Mon 13:34] => 142:17
CLOCK: [2015-12-22 Tue 15:06]--[2015-12-22 Tue 15:11] =>  0:05
CLOCK: [2015-12-22 Tue 15:03]--[2015-12-22 Tue 15:06] =>  0:03
:END:
[2015-12-22 Tue 15:03]
[[file:~/Code/enderlabs/eventboard.io/mq/eventmq/scheduler.py]]
for example, a plugin has been disabled, but the schedule hasn't been removed
for some reason
*** DONE add a header field to SCHEDULE
:PROPERTIES:
:ID:       700FE422-D105-4E59-A806-35868818FAA5
:END:
:LOGBOOK:
CLOCK: [2016-01-04 Mon 18:10]--[2016-01-04 Mon 18:35] =>  0:25
:END:
default: ensure the message is delivered
*** DONE [#A] implement scheduler's on_schedule method
:LOGBOOK:
CLOCK: [2015-12-30 Wed 15:39]--[2015-12-30 Wed 16:09] =>  0:30
:END:
*** DONE [#C] Refactor common methods for jobmanager and scheduler
:LOGBOOK:
CLOCK: [2015-12-29 Tue 12:39]--[2015-12-29 Tue 12:46] =>  0:07
:END:
:PROPERTIES:
:ID:       2B6C8141-FE67-4D9F-B6BD-71106189444F
:END:
*** DONE Allow input fields to have author defined validation rules
:LOGBOOK:
CLOCK: [2015-12-17 Thu 09:57]--[2015-12-17 Thu 10:11] =>  0:14
:END:
:PROPERTIES:
:ID:       22300853-4262-4CC3-9145-1B2788FC3E8B
:JIRA:     [[https://eventboard.atlassian.net/browse/EB-2867][EB-2313]]
:END:
[2015-12-17 Thu 09:57]
Lucas has hacked in django form validation to config.json
*** DONE Define and create the api for setting a job to run on an interval
:LOGBOOK:
CLOCK: [2015-12-22 Tue 14:34]--[2015-12-22 Tue 15:03] =>  0:29
CLOCK: [2015-12-22 Tue 13:34]--[2015-12-22 Tue 14:34] =>  1:00
:END:
:PROPERTIES:
:ID:       3D337B7F-D145-4BD6-ABB8-862A7696D1CA
:END:
The crux of this problem is not how to run a scheduled job, but how to define
the schedule in a consistent and scale-able way. The schedulers are keepers of
time and passers of messages. Each one should be able to handle many many
schedules. Some how they need to load balance the schedules between each other
for a clustered setup, or there needs to be a well defined sharding plan.

There might need to be a map of jobs to schedulers so that if needed, the
client can request the scheduler stop running the job. This state information
makes sense to live in the broker :(.

To do a stateless setup, the job is associated with a permanent scheduler id so
that the client application can SHOUT that job be stopped.

2015-12-22 14:58:07,186 - eventmq.utils.messages  DEBUG - Forwarding message:
['147fda25-c8fb-40c0-9db0-c9ef8bab540d',
 '',
 'eMQP/1.0',
 'SCHEDULE',
 '8075e68b-79a6-4648-8d03-71e17012dda0',
 'default',
 '300',
 '["run", {"args": [], "class_args": [], "callable": "dumps", "kwargs": {},
   "path": "json", "class_kwargs": {}}]'
]
*** DONE Test that the job manager waits while jobs are still running
:LOGBOOK:
CLOCK: [2015-12-30 Wed 18:47]--[2015-12-30 Wed 18:48] =>  0:01
:END:
[2015-12-30 Wed 18:47]
[[file:~/Code/org/eventmq.org::*MEETING%20Review%20the%20onboarding%20process%20(using%20notes)][MEETING Review the onboarding process (using notes)]]
*** DONE Allow definable available worker slots for jobmanager
:LOGBOOK:
CLOCK: [2015-12-29 Tue 13:08]--[2015-12-29 Tue 13:09] =>  0:01
:END:
[2015-12-29 Tue 13:08]
[[file:~/Code/enderlabs/eventboard.io/mq/eventmq/jobmanager.py::self.send_ready()]]
*** TODO EB INTEGRATIONS sign up for new box.com account to replace oauth2 string.
:PROPERTIES:
:ID:       14A6A422-B048-41FA-B966-81C2213592C3
:END:
:LOGBOOK:
CLOCK: [2015-12-15 Tue 14:15]--[2015-12-15 Tue 14:16] =>  0:01
CLOCK: [2015-12-15 Tue 13:15]--[2015-12-15 Tue 14:15] =>  1:00
CLOCK: [2015-12-15 Tue 12:57]--[2015-12-15 Tue 13:14] =>  0:17
:END:
:PROPERTIES:
:ID:       A5E1FEEC-4CE8-4190-9CF8-F0BFF4C93A98
:END:
[2015-12-15 Tue 12:57]
Tell will to have the company re-authorize the addon.
*** TODO Take into account other queues that might have waiting messages when a worker returns from duty
:PROPERTIES:
:ID:       2FE9EB47-97AD-447C-9842-BB59A44BAA5A
:END:
:LOGBOOK:
CLOCK: [2015-12-15 Tue 15:57]--[2015-12-15 Tue 18:45] =>  2:48
:END:
:PROPERTIES:
:ID:       B4F5DCB3-AFD5-40ED-9637-FAAE72AC3D5B
:END:
[2015-12-15 Tue 15:57]
[[file:~/Code/enderlabs/mq/eventmq/router.py::if%20self.workers%5Bsender%5D%5B'queues'%5D%20in%20self.waiting_messages:][file:~/Code/enderlabs/mq/eventmq/router.py::if
self.workers[sender]['queues'] in self.waiting_messages:]]

*** TODO Add logic to end the meeting for longer than the impromptu meeting length if needed
:PROPERTIES:
:ID:       4A4EAE0D-AF69-4A19-A96D-102F08B4F7BA
:END:
:LOGBOOK:
CLOCK: [2015-12-17 Thu 17:41]--[2015-12-17 Thu 18:25] =>  0:44
:END:
:PROPERTIES:
:ID:       C06DD0AC-382F-455A-8C8B-2CD29DE8C1D5
:END:
[2015-12-17 Thu 17:41]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::end%3Ddt_last_motion%20%2B%20datetime.timedelta(][file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::end=dt_last_motion + datetime.timedelta(]]
*** TODO User configurable Impromptu event length
:PROPERTIES:
:ID:       82B3B512-5B5E-4EC2-8B58-4AC6D80DC52B
:END:
:LOGBOOK:
CLOCK: [2015-12-16 Wed 18:09]--[2015-12-16 Wed 18:10] =>  0:01
:END:
:PROPERTIES:
:ID:       01D856B2-834D-4525-963E-EB4FF84E2953
:END:
[2015-12-16 Wed 18:09]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::ebroom%20%3D%20Room.objects.get(pk%3Dself.room_map%5Broom_name%5D)][file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::ebroom = Room.objects.get(pk=self.room_map[room_name])]]
*** TODO Implement a json parser
:PROPERTIES:
:ID:       8C78C973-DF73-450B-B937-1FD315F1F977
:END:
:LOGBOOK:
CLOCK: [2015-12-16 Wed 11:07]--[2015-12-16 Wed 11:09] =>  0:02
:END:
:PROPERTIES:
:ID:       A7F70D04-5CC1-4615-91BA-86D59220F9CA
:END:
[2015-12-16 Wed 11:07]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/__init__.py]]
Reading the data from the buffer would be ideal for organizations with huge
datasets (e.g. Facebook). Version 2.0 should focus on rewriting the logic to do this.
*** TODO Research the linger option in the close.
:PROPERTIES:
:ID:       DA9C1CA7-3256-4DD5-99BF-B4FC3A2FE2BC
:END:
:LOGBOOK:
CLOCK: [2015-12-15 Tue 19:26]--[2015-12-15 Tue 19:27] =>  0:01
:END:
:PROPERTIES:
:ID:       DDE57756-0D2F-44CE-9E25-46DD12323A4C
:END:
[2015-12-15 Tue 19:26]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/hooks.py::socket.zsocket.close()]]
Connect and send aren't going to block but the message needs to be sent before the socket is actually closed
*** TODO 100% test coverage with some functional tests & benchmarks :EventMQ 1.0:
:PROPERTIES:
:ID:       4C027E33-A368-4E99-B040-C29E552345B9
:END:
:LOGBOOK:
CLOCK: [2015-12-15 Tue 15:48]--[2015-12-15 Tue 15:57] =>  0:09
CLOCK: [2015-12-15 Tue 15:22]--[2015-12-15 Tue 15:48] =>  0:26
:END:
:PROPERTIES:
:ID:       50946F16-EE38-427B-B897-A63AD92B0473
:END:
[2015-12-15 Tue 15:22]
[[file:~/Code/enderlabs/mq/eventmq/jobmanager.py::self.poller.unregister(self.incoming)]]

*** TODO Target PyCharm as the official plugin creator.
:PROPERTIES:
:ID:       C8124C2E-24CB-4F5B-999E-CB749A253F58
:END:
:LOGBOOK:
CLOCK: [2015-12-17 Thu 17:33]--[2015-12-17 Thu 17:41] =>  0:08
CLOCK: [2015-12-17 Thu 16:55]--[2015-12-17 Thu 17:32] =>  0:37
CLOCK: [2015-12-17 Thu 16:40]--[2015-12-17 Thu 16:54] =>  0:14
:END:
:PROPERTIES:
:ID:       609F983E-654E-4AA9-BD05-D614B03A7617
:END:
[2015-12-17 Thu 16:40]

*** TODO Come up with a better plan for redwood's self.save_data/save_settings so the saves are batched
:PROPERTIES:
:ID:       30049D1F-C95B-4DCD-A589-716CBB4878BC
:END:
:LOGBOOK:
CLOCK: [2015-12-17 Thu 18:25]--[2015-12-17 Thu 18:41] =>  0:16
:END:
:PROPERTIES:
:ID:       73FA4D98-7ED9-4DF0-B5A1-FDB2DE4DCA49
:END:
[2015-12-17 Thu 18:25]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::self.save_data()]]
If too many of these show up within the loop, then it's going to slow down
everything. Add something (at the top of the loop) that checks to see if the
settings/config are dirty, if they are, then save it.
*** TODO Test for daylight savings time
:PROPERTIES:
:ID:       2CF6F1F5-3291-4E67-9059-076DD210FBEF
:END:
:LOGBOOK:
CLOCK: [2015-12-18 Fri 11:15]--[2015-12-18 Fri 11:24] =>  0:09
CLOCK: [2015-12-18 Fri 11:11]--[2015-12-18 Fri 11:15] =>  0:04
CLOCK: [2015-12-17 Thu 19:54]--[2015-12-18 Fri 11:10] => 15:16
:END:
:PROPERTIES:
:ID:       75DAA1F0-27EB-4BD4-865E-02715B7C24AC
:END:
[2015-12-17 Thu 19:54]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/tests.py::now%20%3D%20int(time.time())][file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/tests.py::now = int(time.time())]]
If Redwood's currentTime is on DST, and we are not (e.g. in the east coast)
If we are and Redwood is not (e.g. in the west coast)
*** TODO Revisit Eventboard vagrant's logging setup. Make it personalizable
:PROPERTIES:
:ID:       EF74FFEC-098E-4750-9F32-EF55A7579A86
:END:
:LOGBOOK:
CLOCK: [2015-12-17 Thu 17:32]--[2015-12-17 Thu 17:33] =>  0:01
:END:
:PROPERTIES:
:ID:       F7402D2F-8D1F-4F24-BBAD-CA88FE05A285
:END:
[2015-12-17 Thu 17:32]
[[file:~/Code/enderlabs/eventboard.io/apps/eventboard/settings/local_settings.py::'level':%20'DEBUG',][file:~/Code/enderlabs/eventboard.io/apps/eventboard/settings/local_settings.py::'level': 'DEBUG',]]
*** TODO Add a logging level to log raw data for a 'replication/backup/bin?/wal? log'?
:PROPERTIES:
:ID:       238EDFBB-24A6-4FD8-B434-F2A28B02A41F
:END:
:LOGBOOK:
CLOCK: [2015-12-16 Wed 21:53]--[2015-12-16 Wed 21:54] =>  0:01
:END:
:PROPERTIES:
:ID:       F933F84D-1F2C-44AA-9405-363E2CBBEA5D
:END:
[2015-12-16 Wed 21:53]
*** TODO Make eventboard.settings.base_test.py:10 a toggleable option from local_settings
:PROPERTIES:
:ID:       DC4A957C-FF72-4928-B942-273E7FFF64E8
:END:
:LOGBOOK:
CLOCK: [2015-12-16 Wed 20:02]--[2015-12-16 Wed 20:03] =>  0:01
:END:
:PROPERTIES:
:ID:       5D285CC2-0886-455F-8891-9303F5BCF165
:END:
[2015-12-16 Wed 20:02]
local_settings should be for developers only. used to tweak the system
*** TODO Possibly add back in the lag peice to Redwood.
:PROPERTIES:
:ID:       06DB7F22-56FF-4623-BC79-9B1DFE33B77C
:END:
:LOGBOOK:
CLOCK: [2015-12-16 Wed 17:33]--[2015-12-16 Wed 17:35] =>  0:02
:END:
:PROPERTIES:
:ID:       D13B2C3F-4B18-4105-A1FE-9D3DF3B17653
:END:
[2015-12-16 Wed 17:33]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::now%20%3D%20int(data%5B'currentTime'%5D)%20#%20add%20%2Blag%20to%20make%20up%20for%20seconds?][file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/rw.py::now = int(data['currentTime']) # add +lag to make up for seconds?]]
Possibly divide the number by 2 to account for the first half of the request
where it wasn't that time.
Possibly subtract the seconds difference from now() and the reported redwood
room, assuming the clocks are in sync. ** Document setting this up in Redwood
*** TODO Create a test framework for testing all the plugins, including o365
:PROPERTIES:
:ID:       52D6BA64-0293-45ED-8B4C-E19DE224EB40
:END:
:LOGBOOK:
CLOCK: [2015-12-16 Wed 14:26]--[2015-12-16 Wed 14:27] =>  0:01
:END:
:PROPERTIES:
:ID:       10E793E3-BAF8-4C8C-B405-F3ACDA4251AA
:END:
[2015-12-16 Wed 14:26]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/redwood/tests.py]]
*** TODO Schedule meeting with Insights to ask them how they are using "EVENT_CHANGE" if there are going to be a lot of very specific event_change types.
:PROPERTIES:
:ID:       4A31C47A-E635-41D1-BEC6-68D6281483EA
:END:
:LOGBOOK:
CLOCK: [2015-12-22 Tue 11:11]--[2015-12-22 Tue 11:12] =>  0:01
:END:
[2015-12-22 Tue 11:11]
They will need to be more or less dynamic without a "Choices" helper otherwise
the data structure is going to get out of hand. The data for the specific types
should live in their specific implementation (e.g. Redwood_Cancellation))
*** TODO Don't silently drop non-ack messages while waiting for an ack at startup.
:PROPERTIES:
:ID:       B7C79866-C7CD-4898-A654-7960EE185046
:END:
:LOGBOOK:
CLOCK: [2015-12-29 Tue 13:09]--[2015-12-29 Tue 13:11] =>  0:02
CLOCK: [2015-12-29 Tue 12:46]--[2015-12-29 Tue 13:08] =>  0:22
:END:
[2015-12-29 Tue 12:46]
[[file:~/Code/enderlabs/eventboard.io/mq/eventmq/utils/classes.py::#%20TODO%20This%20will%20silently%20drop%20messages%20that%20aren't%20ACK][file:~/Code/enderlabs/eventboard.io/mq/eventmq/utils/classes.py::# TODO This will silently drop messages that aren't ACK]]

*** TODO How to prevent duplicate schedules from being executed?
:PROPERTIES:
:ID:       E0E19A5F-D230-4F47-AB76-F76FCD07D542
:END:
:LOGBOOK:
CLOCK: [2015-12-30 Wed 21:23]--[2015-12-30 Wed 21:24] =>  0:01
:END:
:PROPERTIES:
:CREATED: <2015-12-30 Wed 21:23>
:END:
if a schedule for the same thing is received more than once, the scheduler will
happily execute all jobs. How can this be prevented in the plugin system. Does
it need prevented in eventmq core?
*** TODO the eventboard plugin.hooks.schedule method needs to define some way that the company id can be passed to the plugin.
:PROPERTIES:
:ID:       2CABD377-FE25-4E9F-870B-A1A22706841B
:END:
:LOGBOOK:
CLOCK: [2015-12-22 Tue 15:11]--[2015-12-22 Tue 15:17] =>  0:06
:END:
[2015-12-22 Tue 15:11]
[[file:~/Code/enderlabs/eventboard.io/apps/integrations/plugins/hooks.py]]
*** TODO When receiving an invalid message from the router, don't just ignore it
:PROPERTIES:
:ID:       465B5CA2-8433-4E9D-8975-AF3CFAAFFDF7
:END:
:LOGBOOK:
CLOCK: [2015-12-29 Tue 13:11]--[2015-12-29 Tue 13:12] =>  0:01
:END:
[2015-12-29 Tue 13:11]
[[file:~/Code/enderlabs/eventboard.io/mq/eventmq/utils/classes.py::return]]
**** DONE Execute current plugin jobs in worker.
:LOGBOOK:
CLOCK: [2015-12-14 Mon 12:26]--[2015-12-14 Mon 13:00] =>  0:34
CLOCK: [2015-12-14 Mon 12:06]--[2015-12-14 Mon 12:17] =>  0:11
:END:
:PROPERTIES:
:ID:       22BE9CA4-6A70-4C69-8775-269098A09E75
:END:
**** FIXED Router crashes when fwdmsg to dead worker
Updated fwd_emqp_router_message to raise an EventMQError instead of passing the ZMQError upstream

Fixed by catching the exeception and calling the process method recursively
:LOGBOOK:
CLOCK: [2015-12-14 Mon 13:50]--[2015-12-14 Mon 14:28] =>  0:38
CLOCK: [2015-12-14 Mon 12:17]--[2015-12-14 Mon 12:26] =>  0:09
CLOCK: [2015-12-14 Mon 11:45]--[2015-12-14 Mon 11:49] =>  0:04
:END:
:PROPERTIES:
:ID:       1C45D4E4-4636-413A-ADB1-5C7D3A671AF1
:END:
**** DONE [#A] Run the actual functions somewhere else.       :jobmanager:
:LOGBOOK:
CLOCK: [2015-12-15 Tue 12:28]--[2015-12-15 Tue 12:57] =>  0:29
:END:
:PROPERTIES:
:ID:       7B68F9B3-D3C2-4D20-8B49-F50E113A74AF
:END:
[2015-12-07 Mon 14:39]
Doing this will free up the event loop to continue sending heartbeat commands to
prevent disconnects.
**** DONE implement credit-based flow control so job managers spin up a sane number of jobs :jobmanager:
:LOGBOOK:
CLOCK: [2015-12-15 Tue 18:58]--[2015-12-15 Tue 20:47] =>  1:49
CLOCK: [2015-12-15 Tue 18:45]--[2015-12-15 Tue 18:58] =>  0:13
CLOCK: [2015-12-15 Tue 14:55]--[2015-12-15 Tue 15:22] =>  0:27
CLOCK: [2015-12-15 Tue 14:19]--[2015-12-15 Tue 14:39] =>  0:20
:END:
:PROPERTIES:
:ID:       325D6E54-C821-4FAE-B2D4-CB7AE66BC986
:END:
- [X] A JobManager SHOULD send as many READY request messages as jobs it would like to
run concurrently. The Router MUST keep track of each ready request in a waiting
worker queue. The Router could have a data structure to track these similar to
this: (('worker uuid', 'READY message uuid')) so that if need be the message can
be referred to.
- [X] As the Router accepts jobs it cycle through the worker queue passing jobs to the
workers.
- [X] The JobManager should be logging worker output so that the entirety of a
message's job can be traced out.
